In [1]:
'''
GA Data Science Q2 2016

Code walk-through 18: Databases and SQL
'''

import os

import numpy as np
import pandas as pd

import sqlite3

In [4]:
CYCLE_HIRES_URL = 'https://files.datapress.com/london/dataset/number-bicycle-hires/2016-05-17T09:24:57/tfl-daily-cycle-hires.xls'

# Load TfL Cycle Hire dataset
hires = pd.read_excel(CYCLE_HIRES_URL, sheetname='Data')

# Convert 'Day' to 'datetime' and set as index
hires.Day = pd.to_datetime(hires.Day, unit='D')
hires.set_index('Day', inplace=True)

# Extract first column (daily hires) and convert to 'float'
hires = hires.iloc[:,0].astype('float').to_frame('Hires')

# Write DataFrame to disk
db_connection = sqlite3.connect('../../Data/tfl_cycle_hire.db')
hires.to_sql('hires', con=db_connection, if_exists='replace')

In [5]:
# Retrieve first 10 records, output will be a dataframe.
pd.io.sql.read_sql('SELECT * FROM hires LIMIT 10', con=db_connection)

                   Day   Hires
0  2010-07-30 00:00:00  6897.0
1  2010-07-31 00:00:00  5564.0
2  2010-08-01 00:00:00  4303.0
3  2010-08-02 00:00:00  6642.0
4  2010-08-03 00:00:00  7966.0
5  2010-08-04 00:00:00  7893.0
6  2010-08-05 00:00:00  8724.0
7  2010-08-06 00:00:00  9797.0
8  2010-08-07 00:00:00  6631.0
9  2010-08-08 00:00:00  7864.0

In [6]:
# Retrieve all records from 2016
pd.io.sql.read_sql(
    '''SELECT Hires
       FROM hires
       WHERE STRFTIME(\'%Y\', Day) == \'2016\'''', con=db_connection)

       Hires
0     9922.0
1     7246.0
2     4894.0
3    20644.0
4    22934.0
5    23199.0
6    18225.0
7    20948.0
8    11674.0
9    14447.0
10   21188.0
11   22924.0
12   24726.0
13   22266.0
14   22594.0
15   16258.0
16   11826.0
17   22905.0
18   23919.0
19   23919.0
20   23490.0
21   18431.0
22   17424.0
23   16474.0
24   25886.0
25   20329.0
26   21816.0
27   25490.0
28   22701.0
29   16528.0
..       ...
91   27310.0
92   24416.0
93   21068.0
94   25182.0
95   30155.0
96   24132.0
97   22338.0
98   27357.0
99   19858.0
100  23389.0
101  24162.0
102  30801.0
103  30285.0
104  30566.0
105  15919.0
106  17801.0
107  18274.0
108  28512.0
109  33719.0
110  34577.0
111  31937.0
112  20532.0
113  22060.0
114  18873.0
115  24389.0
116  27862.0
117  28431.0
118  28901.0
119  25658.0
120  24844.0

[121 rows x 1 columns]

In [7]:
# Compute average number of cycle hires by month
pd.io.sql.read_sql(
    '''SELECT Day, AVG(Hires) AS average_hires
       FROM hires
       GROUP BY STRFTIME(\'%m\', Day)''', con=db_connection)

                    Day  average_hires
0   2016-01-31 00:00:00   16811.559140
1   2016-02-29 00:00:00   18038.617647
2   2016-03-31 00:00:00   21519.935484
3   2016-04-30 00:00:00   24381.694444
4   2015-05-31 00:00:00   27029.909677
5   2015-06-30 00:00:00   29356.626667
6   2015-07-31 00:00:00   32177.337580
7   2015-08-31 00:00:00   27683.370968
8   2015-09-30 00:00:00   27247.894444
9   2015-10-31 00:00:00   24610.790323
10  2015-11-30 00:00:00   20524.994444
11  2015-12-31 00:00:00   15267.236559

In [8]:
# Aggregate records by year and month, then sort by total number of cycle hires
pd.io.sql.read_sql(
    '''SELECT Day, SUM(Hires) AS total_hires
       FROM hires
       GROUP BY STRFTIME(\'%Y%m\', Day)
       ORDER BY total_hires DESC''', con=db_connection)

                    Day  total_hires
0   2014-07-31 00:00:00    1183182.0
1   2012-08-31 00:00:00    1163171.0
2   2015-07-31 00:00:00    1134816.0
3   2014-09-30 00:00:00    1058684.0
4   2014-08-31 00:00:00    1055206.0
5   2014-06-30 00:00:00    1052573.0
6   2015-08-31 00:00:00    1042932.0
7   2015-06-30 00:00:00    1039768.0
8   2012-09-30 00:00:00    1015145.0
9   2012-07-31 00:00:00    1014174.0
10  2013-07-31 00:00:00     998755.0
11  2012-05-31 00:00:00     926952.0
12  2014-10-31 00:00:00     907998.0
13  2013-08-31 00:00:00     904155.0
14  2015-09-30 00:00:00     903429.0
15  2015-05-31 00:00:00     899969.0
16  2014-05-31 00:00:00     890709.0
17  2015-10-31 00:00:00     885375.0
18  2012-06-30 00:00:00     858805.0
19  2012-10-31 00:00:00     856866.0
20  2015-04-30 00:00:00     838484.0
21  2012-03-31 00:00:00     818209.0
22  2013-06-30 00:00:00     813631.0
23  2014-04-30 00:00:00     805571.0
24  2016-04-30 00:00:00     763308.0
25  2014-03-31 00:00:00     757864.0
26  2013-05-31 00:00:00     749934.0
27  2012-11-30 00:00:00     726893.0
28  2011-05-31 00:00:00     722072.0
29  2014-11-30 00:00:00     715447.0
..                  ...          ...
40  2012-04-30 00:00:00     649473.0
41  2011-08-31 00:00:00     642440.0
42  2011-06-30 00:00:00     638717.0
43  2015-12-31 00:00:00     608164.0
44  2016-02-29 00:00:00     597641.0
45  2011-11-30 00:00:00     597191.0
46  2016-01-31 00:00:00     586325.0
47  2015-01-31 00:00:00     583663.0
48  2014-12-31 00:00:00     579853.0
49  2013-01-31 00:00:00     565589.0
50  2011-03-31 00:00:00     556155.0
51  2015-02-28 00:00:00     549278.0
52  2010-10-31 00:00:00     544412.0
53  2010-09-30 00:00:00     540859.0
54  2014-02-28 00:00:00     522940.0
55  2013-02-28 00:00:00     516588.0
56  2013-11-30 00:00:00     514146.0
57  2012-12-31 00:00:00     513444.0
58  2013-03-31 00:00:00     504611.0
59  2012-01-31 00:00:00     494325.0
60  2014-01-31 00:00:00     493870.0
61  2012-02-29 00:00:00     481826.0
62  2010-11-30 00:00:00     456304.0
63  2013-12-31 00:00:00     443942.0
64  2011-12-31 00:00:00     408729.0
65  2011-01-31 00:00:00     403178.0
66  2011-02-28 00:00:00     398292.0
67  2010-08-31 00:00:00     341203.0
68  2010-12-31 00:00:00     285574.0
69  2010-07-31 00:00:00      12461.0

[70 rows x 2 columns]